import this
"""Дзен Python, автор Тим Питерс

Красивое лучше уродливого.
Явное лучше неявного.
Простое лучше сложного.
Сложное лучше сложного.
Плоский лучше, чем вложенный.
Разрозненные лучше, чем плотные.
Удобство чтения имеет значение.
Особые случаи не настолько особенны, чтобы нарушать правила.
Хотя практичность побеждает чистоту.
Ошибки никогда не должны проходить молча.
Если только они явно не замалчиваются.
Перед лицом двусмысленности откажитесь от искушения угадывать.
Должен быть один - и желательно только один - очевидный способ сделать это.
Хотя этот способ может быть неочевиден вначале, если вы не голландец.
Сейчас лучше, чем никогда.
Хотя "никогда" часто лучше, чем "прямо сейчас".
Если реализацию трудно объяснить, это плохая идея.
Если реализацию легко объяснить, это может быть хорошей идеей.
Пространства имен - отличная идея - давайте делать их больше!

"""
